InformationRegisters/ЖурналСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизвольноеОписание</Name>
					<Comment>Если ИСТИНА, то в ресурсе ЗначениеПараметра1 хранится код справочника с произвольным описанием</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСобытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПроизвольноеОписаниеСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПроизвольноеОписаниеСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодПроизвольногоСобытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омЖурналСобытий/Ext/Module.bsl
//Если последний символ стПараметров.Первый = "@", тогда символ "@" игнорируется и к строке добавляется значение стПараметров.Второй
//Получается один параметр длиной до 39 знаков
&НаСервере
Процедура ЗаписатьВЖурналСобытий(КодСобытия = 0,Источник,стПараметров = Неопределено,ОписаниеСобытия = "",СтатусСобытия = Неопределено,ТипСобытия = Неопределено) Экспорт
	
	ПроизвольноеОписание 	= НЕ ПустаяСтрока(ОписаниеСобытия);
	Автор 					= ПараметрыСеанса.ТекущийПользователь;
	Дата 					= ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ЖурналСобытий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Дата.Установить(Дата);
	НаборЗаписей.Отбор.Автор.Установить(Автор);
	НаборЗаписей.Отбор.КодСобытия.Установить(КодСобытия);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Автор 			= Автор;
	НоваяЗапись.Дата 			= Дата;
	НоваяЗапись.Источник 		= Источник; 
	НоваяЗапись.КодСобытия 		= КодСобытия;
	НоваяЗапись.ИмяКомпьютера 	= ИмяКомпьютера();
	
	Если ПроизвольноеОписание Тогда
		НачатьТранзакцию();
		Попытка
			Для х = 1 По 5 Цикл
				НомерЗаписи = ПопыткаЗаписатьПроизвольноеОписание(ОписаниеСобытия,СтатусСобытия,ТипСобытия);
				Если НЕ ПустаяСтрока(НомерЗаписи) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ПустаяСтрока(НомерЗаписи) Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НоваяЗапись.ЗначениеПараметра1 = НомерЗаписи;
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	Иначе 
		Если Тип("Структура") = ТипЗнч(стПараметров) Тогда
			НоваяЗапись.ЗначениеПараметра1 = стПараметров.Первый;
			НоваяЗапись.ЗначениеПараметра2 = стПараметров.Второй;
		КонецЕсли;
		НоваяЗапись.ПроизвольноеОписание = ПроизвольноеОписание;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьВЖурналСобытий()

&НаСервере
Функция ПопыткаЗаписатьПроизвольноеОписание(ОписаниеСобытия,СтатусСобытия,ТипСобытия)
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ПроизвольноеОписаниеСобытий");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
		БлокировкаДанных.Заблокировать(); 
		
		КодПроизвольногоСобытия = "0";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ПроизвольноеОписаниеСобытий.КодПроизвольногоСобытия), ""0"") КАК КодПроизвольногоСобытия
		|ИЗ
		|	РегистрСведений.ПроизвольноеОписаниеСобытий КАК ПроизвольноеОписаниеСобытий";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл                                              
			КодПроизвольногоСобытия = Выборка.КодПроизвольногоСобытия;
		КонецЦикла;
		
		КодПроизвольногоСобытия = Формат(Число(КодПроизвольногоСобытия) + 1,"ЧЦ=20; ЧВН=; ЧГ=0"); 
		
		НаборЗаписей = РегистрыСведений.ПроизвольноеОписаниеСобытий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КодПроизвольногоСобытия.Установить(КодПроизвольногоСобытия);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.КодПроизвольногоСобытия = КодПроизвольногоСобытия;
		НоваяЗапись.ОписаниеСобытия 		= ОписаниеСобытия;
		НоваяЗапись.СтатусСобытия 			= СтатусСобытия;
		НоваяЗапись.ТипСобытия 				= ТипСобытия;
		НоваяЗапись.Дата 					= ТекущаяДата();
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Возврат КодПроизвольногоСобытия;
	Исключение
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
	
КонецФункции // ПопыткаЗаписатьПроизвольноеОписание(ОписаниеСобытия,СтатусСобытия)

&НаСервере
Функция ЗаполнитьПараметрыЖурналаСобытий(стрДанные,стрДанные2 = "",ВозможноОбъединение = Истина) Экспорт
	стПараметров = Новый Структура("Первый,Второй","","");
	Если СтрДлина(стрДанные) > 20 И ВозможноОбъединение Тогда
		стПараметров.Первый = Лев(стрДанные,19) + "@";	
		стПараметров.Второй = Сред(стрДанные,20);	
	Иначе
		стПараметров.Первый = стрДанные;
		стПараметров.Второй = стрДанные2;	
	КонецЕсли;	
	
	Возврат стПараметров
КонецФункции // ЗаполнитьПараметрыЖурналаСобытий() 

&НаСервере
Функция СоединитьПараметры(стПараметров,ОдинПараметр = Неопределено) Экспорт
	Если СтрДлина(стПараметров.Первый) = 20 Тогда
		Если Прав(стПараметров.Первый,1) = "@" Тогда
			ОдинПараметр = Истина;
			Возврат Лев(стПараметров.Первый,19) + стПараметров.Второй;	
		КонецЕсли;
	КонецЕсли;
	ОдинПараметр = Ложь;	
	Возврат стПараметров.Первый; 
КонецФункции // СоединитьПараметры()
